const faktyArr = [
 `Разделив октаву на 2 части, можно быстро получить два интервала - ` 
 + `</br>` + `ТТТ (тритоны)`,

 `Разделив октаву на 3 части, можно быстро получить три интервала - ` 
 + `</br>` + ` Б3 (большие терции)`,

 `Разделив октаву на 4 части, можно быстро получить четыре интервала - ` 
 + `</br>` + `м3 (малые терции)`,

 `Разделив октаву на 6 частей, можно быстро получить шесть интервалов - ` 
 + `</br>` + `Б2 (большие секунды)`,

 `состав одной целотоновой гаммы от одной ноты - ` 
 + `</br>` + `Б2,Б3,ТТТ,м6,м7`,

 `состав одной целотоновой гаммы от шести нот - ` 
 + `</br>` + `Б2 Б2 Б2 Б2 Б2 Б2` 
 + `</br>` + `Б3 Б3 Б3 Б3 Б3 Б3`
 + `</br>` + `3Т 3Т 3Т 3Т 3Т 3Т`
 + `</br>` + `м6 м6 м6 м6 м6 м6`
 + `</br>` + `м7 м7 м7 м7 м7 м7`,

`секунды мажорной гаммы - ` 
 + `</br>` + `Б Б м Б Б Б м`,

 `терции мажорной гаммы - ` 
 + `</br>` + `Б м м Б Б м м`,

 `кварты мажорной гаммы - ` 
 + `</br>` + `ч ч ч ув ч ч ч`,

 `квинты мажорной гаммы - ` 
 + `</br>` + `ч ч ч ч ч ч ум`,

 `сексты мажорной гаммы - ` 
 + `</br>` + `Б Б м Б Б м м`,

 `септимы мажорной гаммы - ` 
 + `</br>` + `Б м м Б м м м`,

 `состав одной мажорной гаммы - ` 
 + `</br>` + `секунды - Б Б м Б Б Б м` 
 + `</br>` + `терции - Б м м Б Б м м`
 + `</br>` + `кварты - ч ч ч 3Т ч ч ч`
 + `</br>` + `квинты - ч ч ч ч ч ч 3Т`
 + `</br>` + `сексты - Б Б м Б Б м м`
 + `</br>` + `септимы - Б м м Б м м м`,

 `всего м - ` 
 + `</br>` + `Б м м Б м м м`,
];