const faktyArr = [
 `Разделив октаву на 2 части, можно быстро получить два интервала - ` 
 + `</br>` + `ТТТ (тритоны)`,

 `Разделив октаву на 3 части, можно быстро получить три интервала - ` 
 + `</br>` + ` Б3 (большие терции)`,

 `Разделив октаву на 4 части, можно быстро получить четыре интервала - ` 
 + `</br>` + `м3 (малые терции)`,

 `Разделив октаву на 6 частей, можно быстро получить шесть интервалов - ` 
 + `</br>` + `Б2 (большие секунды)`,

 `состав одной целотоновой гаммы от одной ноты - ` 
 + `</br>` + `Б2,Б3,ТТТ,м6,м7`,

 `состав одной целотоновой гаммы от шести нот - ` 
 + `</br>` + `Б2 Б2 Б2 Б2 Б2 Б2` 
 + `</br>` + `Б3 Б3 Б3 Б3 Б3 Б3`
 + `</br>` + `3Т 3Т 3Т 3Т 3Т 3Т`
 + `</br>` + `м6 м6 м6 м6 м6 м6`
 + `</br>` + `м7 м7 м7 м7 м7 м7`,

`секунды мажорной гаммы - ` 
 + `</br>` + `Б Б м Б Б Б м`,

 `терции мажорной гаммы - ` 
 + `</br>` + `Б м м Б Б м м`,

 `кварты мажорной гаммы - ` 
 + `</br>` + `ч ч ч ув ч ч ч`,

 `квинты мажорной гаммы - ` 
 + `</br>` + `ч ч ч ч ч ч ум`,

 `сексты мажорной гаммы - ` 
 + `</br>` + `Б Б м Б Б м м`,

 `септимы мажорной гаммы - ` 
 + `</br>` + `Б м м Б м м м`,

 `состав одной мажорной гаммы - ` 
 + `</br>` + `секунды - Б Б м Б Б Б м` 
 + `</br>` + `терции - Б м м Б Б м м`
 + `</br>` + `кварты - ч ч ч 3Т ч ч ч`
 + `</br>` + `квинты - ч ч ч ч ч ч 3Т`
 + `</br>` + `сексты - Б Б м Б Б м м`
 + `</br>` + `септимы - Б м м Б м м м`,

 `симметричный состав октавы` 
 + `</br>` + `ТТТ + ТТТ`
 + `</br>` + `Б3 + Б3 + Б3`
 + `</br>` + `м3 + м3 + м3 + м3`
 + `</br>` + `Б2 + Б2 + Б2 + Б2 + Б2 + Б2`,

 `интервалов всего:` 
 + `</br>` + `м2=12 Б2=12`
 + `</br>` + `м3=12 Б3=12`
 + `</br>` + `ч4=12 ТТТ=12 ч5=12`
 + `</br>` + `м6=12 Б6=12`
 + `</br>` + `м7=12 Б7=12`
 + `</br>` + `11 интервалов * 12 нот = 132 ед.`,
 
 `варианты построения мажорного трезвучия` 
 + `</br>` + `Б3 + м3 = ч5`
 + `</br>` + `ч5 и Б3 от нижнего звука`
 + `</br>` + `ч5 и м3 вниз от верхнего звука`
 + `</br>` + `Aug трезвучие с понижением на ПТ верхнего звука`
 + `</br>` + `Dim трезвучие с понижением нижнего звука на ПТ`
 + `</br>` + `Dim трезвучие с повышением всей верхней терции на ПТ`
 + `</br>` + `Маж Секст аккорд с переносом верхнего звука на октаву вниз`
 + `</br>` + `Маж Кварт-секст аккорд с переносом нижнего звука на октаву вверх`
 + `</br>` + `1-3-5 ступени мажора (так же 4-6-1(8), 5-7-2(9)) `
 + `</br>` + `Первые три звука септаккорда и мейдж^ аккорда`
 + `</br>` + `2-ой,3-ий,4-ый звуки минорного септ-аккорда`
 + `</br>` + `и варианты в других ладах*`
 
];