let section = document.querySelector('.section'); //секция для клавиатуры
let monitor = document.querySelector('.monitor'); //монитор
let monitor_2 = document.querySelector('.monitor_2'); //монитор 2
let elements = document.querySelectorAll('.elem');
let key = document.querySelectorAll('.key'); //клавиши фортепиано
let buttons = document.querySelectorAll('.btn_gamma')
let buttons_34 = document.querySelectorAll('.maj_34')
let massive = 0;
let wholeToneBoolean = true;
let x_item_led_boolean;
let circle_led_boolean;
let all_key_for_sound = document.querySelectorAll('.key');
let all_audio_elem = document.querySelectorAll('audio');
let array_of_nodelist = [...all_audio_elem];

let notes_123 = document.querySelector('.notes_123');
//массив цифр
let notes_123_mas = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '12', '1'];

let halftones = document.querySelector('.halftones');
//массив полутонов
let halftones_mas = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '10', '11'];

let wholetones = document.querySelector('.wholetones');
//массив тонов
let wholetones_mas = ['0', '0.5', '1', '1.5', '2', '2.5', '3', '3.5', '4', '4.5', '5', '5.5', '6 / 0', '0.5', '1', '1.5', '2', '2.5', '3', '3.5', '4', '4.5', '5', '5.5', '6 / 0', '0.5', '1', '1.5', '2', '2.5', '3', '3.5', '4', '4.5', '5', '5.5', '6 / 0'];

let notes_Intervals = document.querySelector('.notes_Intervals');
//массив интервалов
let notes_Intervals_mas = ['ч1', 'м2', 'Б2', 'м3', 'Б3', 'ч4', 'ТТТ', 'ч5', 'м6', 'Б6', 'м7', 'Б7', 'ч1', 'м2', 'Б2', 'м3', 'Б3', 'ч4', 'ТТТ', 'ч5', 'м6', 'Б6', 'м7', 'Б7', 'ч1', 'м2', 'Б2', 'м3', 'Б3', 'ч4', 'ТТТ', 'ч5', 'м6', 'Б6', 'м7', 'Б7', 'ч1'];

let notes_rim = document.querySelector('.notes_rim');
//массив римских цифр
let notes_rim_mas = ['I', 'bII', 'II', 'bIII', 'III', 'IV', '#IV/bV', 'V', 'bVI', 'VI', 'bVII', 'VII', 'I', 'bII', 'II', 'bIII', 'III', 'IV', '#IV/bV', 'V', 'bVI', 'VI', 'bVII', 'VII', 'I', 'bII', 'II', 'bIII', 'III', 'IV', '#IV/bV', 'V', 'bVI', 'VI', 'bVII', 'VII', 'I'];

let paragrNumb = document.querySelectorAll('p')
let notes_Number = document.querySelector('.notes_Number');
//массив ступеней
let notes_Number_mas = ['1', 'b2', '2', 'b3', '3', '4', '#4/b5', '5', 'b6', '6', 'b7', '7', '1', 'b2', '2', 'b3', '3', '4', '#4/b5', '5', 'b6', '6', 'b7', '7', '1', 'b2', '2', 'b3', '3', '4', '#4/b5', '5', 'b6', '6', 'b7', '7', '1'];

let maj_min = document.querySelector('.maj_min');
//массив маж-мин
let maj_min_mas = ['+', '-', '+', '-', '+', '+', '+/-', '+', '-', '+', '-', '+', '+', '-', '+', '-', '+', '+', '+/-', '+', '-', '+', '-', '+', '+', '-', '+', '-', '+', '+', '+/-', '+', '-', '+', '-', '+', '+'];

let extensions = document.querySelector('.extensions');
//массив надстроек
let extensions_mas = ['1', 'b9', '9', '#9/b3', '3', '11', '#11/b5', '5', '#5/b13', '13', 'b7', '7', '1', 'b9', '9', '#9/b3', '3', '11', '#11/b5', '5', '#5/b13', '13', 'b7', '7', '1', 'b9', '9', '#9/b3', '3', '11', '#11/b5', '5', '#5/b13', '13', 'b7', '7', '1'];

let chords = document.querySelector('.chords');
//массив аккордов
let chords_mas = ['(root)', 'frig', 'add2', 'min', 'maj', 'sus', 'dim', '(5)', 'aug', '6', '7', '^', '(root)', 'frig', 'add2', 'min', 'maj', 'sus', 'dim', '(5)', 'aug', '6', '7', '^', '(root)', 'frig', 'add2', 'min', 'maj', 'sus', 'dim', '(5)', 'aug', '6', '7', '^', '(root)'];

let relative = document.querySelector('.relative');
//массив релятив
let relative_mas = ['ё', 'лу', 'ле', 'ву', 'ви', 'на', 'ни', 'зо', 'ру', 'ра', 'ту', 'ти', 'ё', 'лу', 'ле', 'ву', 'ви', 'на', 'ни', 'зо', 'ру', 'ра', 'ту', 'ти', 'ё', 'лу', 'ле', 'ву', 'ви', 'на', 'ни', 'зо', 'ру', 'ра', 'ту', 'ти', 'ё'];

//цвета релятив
let color = ['#00FF00', '#5A009D', '#fff44f', '#0000FF', '#FF8000', '#7FFFD4', ' #ce2029', '#9acd32', '#8a2be2', '#FFFF00', '#89CFF0', '#FF0000', '#00FF00', '#5A009D', '#fff44f', '#0000FF', '#FF8000', '#7FFFD4', ' #ce2029', '#9acd32', '#8a2be2', '#FFFF00', '#89CFF0', '#FF0000', '#00FF00', '#5A009D', '#fff44f', '#0000FF', '#FF8000', '#7FFFD4', ' #ce2029', '#9acd32', '#8a2be2', '#FFFF00', '#89CFF0', '#FF0000', '#00FF00'];

let relative_center = document.querySelector('.relative_center');
//массив релятив центр
let relative_center_mas = ['ё', 'лу', 'ле', 'ву', 'ви', 'на', 'ни', 'зо', 'ру', 'ра', 'ту', 'ти', 'ё', 'лу', 'ле', 'ву', 'ви', 'на', 'ни', 'зо'];
//цвета релятив
let color_center = ['#00FF00', '#5A009D', '#fff44f', '#0000FF', '#FF8000', '#7FFFD4', ' #ce2029', '#9acd32', '#8a2be2', '#FFFF00', '#89CFF0', '#FF0000', '#00FF00', '#5A009D', '#fff44f', '#0000FF', '#FF8000', '#7FFFD4', ' #ce2029', '#9acd32'];


let wholetoneButtonX = document.querySelector('.wholetoneX'); //кнопка целотон X
let wholetoneButtonY = document.querySelector('.wholetoneY'); //кнопка целотон Y
let wholetoneButtonXY = document.querySelector('.wholetoneXY'); //кнопка целотон XY
let whole_and_half_step_1 = document.querySelector('.whole_and_half_step_1');
let whole_and_half_step_2 = document.querySelector('.whole_and_half_step_2');
let whole_and_half_step_3 = document.querySelector('.whole_and_half_step_3');
let symmetric_1 = document.querySelector('.symmetric_1');
let symmetric_2 = document.querySelector('.symmetric_2');
let symmetric_3 = document.querySelector('.symmetric_3');
let clear = document.querySelector('.clear'); //кнопка очистки
let oneDable = document.querySelector('.oneDable'); //кнопка второй октавы
let keyboard_add2 = document.querySelector('.add2'); //блок второй октавы
let keyboard_add3 = document.querySelector('.add3'); //блок второй октавы
let keyHide = document.querySelector('.key_hide'); //лишняя клавиша

let ident = [
    //малые секунды
    {
        key: '1 b2 ',
        name: 'малая секунда от 1-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b2 2 ',
        name: 'малая секунда от b2-ой ступени',
        symbol: 'м2'
    },
    {
        key: '2 b3 ',
        name: 'малая секунда от 2-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b3 3 ',
        name: 'малая секунда от b3-ой ступени',
        symbol: 'м2'
    },
    {
        key: '3 4 ',
        name: 'малая секунда от 3-ой ступени',
        symbol: 'м2'
    },
    {
        key: '4 b5 ',
        name: 'малая секунда от 4-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b5 5 ',
        name: 'малая секунда от b5-ой ступени',
        symbol: 'м2'
    },
    {
        key: '5 b6 ',
        name: 'малая секунда от 5-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b6 6 ',
        name: 'малая секунда от b6-ой ступени',
        symbol: 'м2'
    },
    {
        key: '6 b7 ',
        name: 'малая секунда от 6-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b7 7 ',
        name: 'малая секунда от b7-ой ступени',
        symbol: 'м2'
    },
    {
        key: '7 1 ',
        name: 'малая секунда от 7-ой ступени',
        symbol: 'м2'
    },
    //большие секунды
    {
        key: '1 2 ',
        name: 'большая секунда от 1-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b2 b3 ',
        name: 'большая секунда от b2-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '2 3 ',
        name: 'большая секунда от 2-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b3 4 ',
        name: 'большая секунда от b3-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '3 b5 ',
        name: 'большая секунда от 3-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '4 5 ',
        name: 'большая секунда от 4-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b5 b6 ',
        name: 'большая секунда от b5-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '5 6 ',
        name: 'большая секунда от 5-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b6 b7 ',
        name: 'большая секунда от b6-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '6 7 ',
        name: 'большая секунда от 6-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b7 1 ',
        name: 'большая секунда от b7-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '7 b2 ',
        name: 'большая секунда от 7-ой ступени',
        symbol: 'Б2'
    },
    //малые терции
    {
        key: '1 b3 ',
        name: 'малая терция от 1-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b2 3 ',
        name: 'малая терция от b2-ой ступени',
        symbol: 'м3'
    },
    {
        key: '2 4 ',
        name: 'малая терция от 2-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b3 b5 ',
        name: 'малая терция от b3-ой ступени',
        symbol: 'м3'
    },
    {
        key: '3 5 ',
        name: 'малая терция от 3-ой ступени',
        symbol: 'м3'
    },
    {
        key: '4 b6 ',
        name: 'малая терция от 4-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b5 6 ',
        name: 'малая терция от b5-ой ступени',
        symbol: 'м3'
    },
    {
        key: '5 b7 ',
        name: 'малая терция от 5-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b6 7 ',
        name: 'малая терция от b6-ой ступени',
        symbol: 'м3'
    },
    {
        key: '6 1 ',
        name: 'малая терция от 6-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b7 b2 ',
        name: 'малая терция от b7-ой ступени',
        symbol: 'м3'
    },
    {
        key: '7 2 ',
        name: 'малая терция от 7-ой ступени',
        symbol: 'м3'
    },
    //большие терции
    {
        key: '1 3 ',
        name: 'большая терция от 1-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b2 4 ',
        name: 'большая терция от b2-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '2 b5 ',
        name: 'большая терция от 2-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b3 5 ',
        name: 'большая терция от b3-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '3 b6 ',
        name: 'большая терция от 3-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '4 6 ',
        name: 'большая терция от 4-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b5 b7 ',
        name: 'большая терция от b5-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '5 7 ',
        name: 'большая терция от 5-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b6 1 ',
        name: 'большая терция от b6-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '6 b2 ',
        name: 'большая терция от 6-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b7 2 ',
        name: 'большая терция от b7-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '7 b3 ',
        name: 'большая терция от 7-ой ступени',
        symbol: 'Б3'
    },
    //чистые кварты
    {
        key: '1 4 ',
        name: 'чистая кварта от 1-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b2 b5 ',
        name: 'чистая кварта от b2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '2 5 ',
        name: 'чистая кварта от 2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b3 b6 ',
        name: 'чистая кварта от b3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '3 6 ',
        name: 'чистая кварта от 3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '4 b7 ',
        name: 'чистая кварта от 4-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b5 7 ',
        name: 'чистая кварта от b5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '5 1 ',
        name: 'чистая кварта от 5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b6 b2 ',
        name: 'чистая кварта от b6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '6 2 ',
        name: 'чистая кварта от 6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b7 b3 ',
        name: 'чистая кварта от b7-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '7 3 ',
        name: 'чистая кварта от 7-ой ступени',
        symbol: 'Ч5'
    },
    //тритоны
    {
        key: '1 b5 ',
        name: 'тритон от 1-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b2 5 ',
        name: 'тритон от b2-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '2 b6 ',
        name: 'тритон от 2-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b3 6 ',
        name: 'тритон от b3-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '3 b7 ',
        name: 'тритон от 3-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '4 7 ',
        name: 'тритон от 4-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b5 1 ',
        name: 'тритон от b5-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '5 b2 ',
        name: 'тритон от 5-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b6 2 ',
        name: 'тритон от b6-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '6 b3 ',
        name: 'тритон от 6-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b7 3 ',
        name: 'тритон от b7-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '7 4 ',
        name: 'тритон от 7-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    //чистые квинты
    {
        key: '1 5 ',
        name: 'чистая квинта от 1-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b2 b6 ',
        name: 'чистая квинта от b2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '2 6 ',
        name: 'чистая квинта от 2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b3 b7 ',
        name: 'чистая квинта от b3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '3 7 ',
        name: 'чистая квинта от 3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '4 1 ',
        name: 'чистая квинта от 4-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b5 b2 ',
        name: 'чистая квинта от b5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '5 2 ',
        name: 'чистая квинта от 5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b6 b3 ',
        name: 'чистая квинта от b6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '6 3 ',
        name: 'чистая квинта от 6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b7 4 ',
        name: 'чистая квинта от b7-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '7 b5 ',
        name: 'чистая квинта от 7-ой ступени',
        symbol: 'Ч5'
    },
    //малые сексты
    {
        key: '1 b6 ',
        name: 'малая секста от 1-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b2 6 ',
        name: 'малая секста от b2-ой ступени',
        symbol: 'м6'
    },
    {
        key: '2 b7 ',
        name: 'малая секста от 2-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b3 7 ',
        name: 'малая секста от b3-ой ступени',
        symbol: 'м6'
    },
    {
        key: '3 1 ',
        name: 'малая секста от 3-ой ступени',
        symbol: 'м6'
    },
    {
        key: '4 b2 ',
        name: 'малая секста от 4-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b5 2 ',
        name: 'малая секста от b5-ой ступени',
        symbol: 'м6'
    },
    {
        key: '5 b3 ',
        name: 'малая секста от 5-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b6 3 ',
        name: 'малая секста от b6-ой ступени',
        symbol: 'м6'
    },
    {
        key: '6 4 ',
        name: 'малая секста от 6-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b7 b5 ',
        name: 'малая секста от b7-ой ступени',
        symbol: 'м6'
    },
    {
        key: '7 5 ',
        name: 'малая секста от 7-ой ступени',
        symbol: 'м6'
    },
    //большие сексты
    {
        key: '1 6 ',
        name: 'большая секста от 1-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b2 b7 ',
        name: 'большая секста от b2-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '2 7 ',
        name: 'большая секста от 2-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b3 1 ',
        name: 'большая секста от b3-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '3 b2 ',
        name: 'большая секста от 3-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '4 2 ',
        name: 'большая секста от 4-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b5 b3 ',
        name: 'большая секста от b5-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '5 3 ',
        name: 'большая секста от 5-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b6 4 ',
        name: 'большая секста от b6-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '6 b5 ',
        name: 'большая секста от 6-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b7 5 ',
        name: 'большая секста от b7-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '7 b6 ',
        name: 'большая секста от 7-ой ступени',
        symbol: 'Б6'
    },
    //мылые септимы
    {
        key: '1 b7 ',
        name: 'малая септима от 1-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b2 7 ',
        name: 'малая септима от b2-ой ступени',
        symbol: 'м7'
    },
    {
        key: '2 1 ',
        name: 'малая септима от 2-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b3 b2 ',
        name: 'малая септима от b3-ой ступени',
        symbol: 'м7'
    },
    {
        key: '3 2 ',
        name: 'малая септима от 3-ой ступени',
        symbol: 'м7'
    },
    {
        key: '4 b3 ',
        name: 'малая септима от 4-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b5 3 ',
        name: 'малая септима от b5-ой ступени',
        symbol: 'м7'
    },
    {
        key: '5 4 ',
        name: 'малая септима от 5-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b6 b5 ',
        name: 'малая септима от b6-ой ступени',
        symbol: 'м7'
    },
    {
        key: '6 5 ',
        name: 'малая септима от 6-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b7 b6 ',
        name: 'малая септима от b7-ой ступени',
        symbol: 'м7'
    },
    {
        key: '7 6 ',
        name: 'малая септима от 7-ой ступени',
        symbol: 'м7'
    },
    //большие септимы
    {
        key: '1 7 ',
        name: 'большая септима от 1-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b2 1 ',
        name: 'большая септима от b2-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '2 b2 ',
        name: 'большая септима от 2-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b3 2 ',
        name: 'большая септима от b3-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '3 b3 ',
        name: 'большая септима от 3-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '4 3 ',
        name: 'большая септима от 4-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b5 4 ',
        name: 'большая септима от b5-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '5 b5 ',
        name: 'большая септима от 5-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b6 5 ',
        name: 'большая септима от b6-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '6 b6 ',
        name: 'большая септима от 6-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b7 6 ',
        name: 'большая септима от b7-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '7 b7 ',
        name: 'большая септима от 7-ой ступени',
        symbol: 'Б7'
    },
    //тетрахорды тональные
    {
        key: '1 2 3 4 ',
        name: 'мажорный тетрахорд от 1-ой ступени',
        symbol: '4-maj'
    },
    {
        key: '2 3 4 5 ',
        name: 'минорный тетрахорд от 2-ой ступени',
        symbol: '4-min'
    },
    {
        key: '3 4 5 6 ',
        name: 'фригийский тетрахорд от 3-й ступени',
        symbol: '4-frig'
    },
    {
        key: '4 5 6 7 ',
        name: 'целотоновый тетрахорд от 4-ой ступени',
        symbol: '4-TTT'
    },
    {
        key: '5 6 7 1 ',
        name: 'мажорный тетрахорд от 5-ой ступени',
        symbol: '4-maj'
    },
    {
        key: '6 7 1 2 ',
        name: 'минорный тетрахорд от 6-ой ступени',
        symbol: '4-min'
    },
    {
        key: '7 1 2 3 ',
        name: 'фригийский тетрахорд от 7-ой ступени',
        symbol: '4-frig'
    },
    //уменьшенные трезвучия
    {
        key: '1 b3 b5 ',
        name: 'уменьшенное трезвучие 1-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b2 3 5 ',
        name: 'уменьшенное трезвучие b2-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '2 4 b6 ',
        name: 'уменьшенное трезвучие 2-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b3 b5 6 ',
        name: 'уменьшенное трезвучие b3-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '3 5 b7 ',
        name: 'уменьшенное трезвучие 3-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '4 b6 7 ',
        name: 'уменьшенное трезвучие 4-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b5 6 1 ',
        name: 'уменьшенное трезвучие b5-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '5 b7 b2 ',
        name: 'уменьшенное трезвучие 5-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b6 7 2 ',
        name: 'уменьшенное трезвучие b6-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '6 1 b3 ',
        name: 'уменьшенное трезвучие 6-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b7 b2 3 ',
        name: 'уменьшенное трезвучие b7-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '7 2 4 ',
        name: 'уменьшенное трезвучие 7-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    //мажорные трезвучия
    {
        key: '1 3 5 ',
        name: 'мажорное трезвучие 1-ой ступени - тоническое',
        symbol: '( T 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b2 4 b6 ',
        name: 'мажорное трезвучие b2-ой ступени',
        symbol: '( bII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '2 b5 6 ',
        name: 'мажорное трезвучие 2-ой ступени',
        symbol: '( II 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b3 5 b7 ',
        name: 'мажорное трезвучие b3-й ступени',
        symbol: '( bIII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '3 b6 7 ',
        name: 'мажорное трезвучие 3-й ступени',
        symbol: '( III 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '4 6 1 ',
        name: 'мажорное трезвучие 4-ой ступени - субдоминантовое',
        symbol: '( S 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b5 b7 b2 ',
        name: 'мажорное трезвучие b5-ой ступени',
        symbol: '( bV 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '5 7 2 ',
        name: 'мажорное трезвучие 5-ой ступени - доминантовое',
        symbol: '( D 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b6 1 b3 ',
        name: 'мажорное трезвучие b6-ой ступени',
        symbol: '( bVI 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '6 b2 3 ',
        name: 'мажорное трезвучие 6-ой ступени',
        symbol: '( VI 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b7 2 4 ',
        name: 'мажорное трезвучие b7-ой ступени',
        symbol: '( bVII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '7 b3 b5 ',
        name: 'мажорное трезвучие 7-ой ступени',
        symbol: '( VII 5/3 ) Б3 + м3 = Ч5'
    },
    //мажорные секст-аккорды
    {
        key: '3 5 1 ',
        name: 'мажорный секст-аккорд  3-й ступени - тонический',
        symbol: '( T 6 ) м3 + Ч4 = м6'
    },
    {
        key: '4 b6 b2 ',
        name: 'мажорный секст-аккорд  4-ой ступени',
        symbol: '( bII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b5 6 2 ',
        name: 'мажорный секст-аккорд  b5-ой ступени',
        symbol: '( II 6 ) м3 + Ч4 = м6'
    },
    {
        key: '5 b7 b3 ',
        name: 'мажорный секст-аккорд  5-ой ступени',
        symbol: '( bIII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b6 7 3 ',
        name: 'мажорный секст-аккорд  b6-ой ступени',
        symbol: '( III 6 ) м3 + Ч4 = м6'
    },
    {
        key: '6 1 4 ',
        name: 'мажорный секст-аккорд  6-ой ступени - субдоминантовый',
        symbol: '( S 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b7 b2 b5 ',
        name: 'мажорный секст-аккорд  b7-ой ступени',
        symbol: '( bV 6 ) м3 + Ч4 = м6'
    },
    {
        key: '7 2 5 ',
        name: 'мажорный секст-аккорд  7-ой ступени - доминантовый',
        symbol: '( D 6 ) м3 + Ч4 = м6'
    },
    {
        key: '1 b3 b6 ',
        name: 'мажорный секст-аккорд  1-ой ступени',
        symbol: '( bVI 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b2 3 6 ',
        name: 'мажорный секст-аккорд  b2-ой ступени',
        symbol: '( VI 6 ) м3 + Ч4 = м6'
    },
    {
        key: '2 4 b7 ',
        name: 'мажорный секст-аккорд  2-ой ступени',
        symbol: '( bVII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b3 b5 7 ',
        name: 'мажорный секст-аккорд  b3-й ступени',
        symbol: '( VII 6 ) м3 + Ч4 = м6'
    },
    //мажорные кварт-секст-аккорды
    {
        key: '5 1 3 ',
        name: 'мажорный кварт-секст-аккорд  5-й ступени - тонический',
        symbol: '( T 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b6 b2 4 ',
        name: 'мажорный кварт-секст-аккорд  b6-ой ступени',
        symbol: '( bII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '6 2 b5 ',
        name: 'мажорный кварт-секст-аккорд  6-ой ступени',
        symbol: '( II 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b7 b3 5 ',
        name: 'мажорный кварт-секст-аккорд  b7-ой ступени',
        symbol: '( bIII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '7 3 b6 ',
        name: 'мажорный кварт-секст-аккорд  7-ой ступени',
        symbol: '( III 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '1 4 6 ',
        name: 'мажорный кварт-секст-аккорд  1-ой ступени - субдоминантовый',
        symbol: '( S 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b2 b5 b7 ',
        name: 'мажорный кварт-секст-аккорд  b2-ой ступени',
        symbol: '( bV 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '2 5 7 ',
        name: 'мажорный кварт-секст-аккорд  2-ой ступени - доминантовый',
        symbol: '( D 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b3 b6 1 ',
        name: 'мажорный кварт-секст-аккорд  b3-й ступени',
        symbol: '( bVI 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '3 6 b2 ',
        name: 'мажорный кварт-секст-аккорд  3-й ступени',
        symbol: '( VI 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '4 b7 2 ',
        name: 'мажорный кварт-секст-аккорд  4-ой ступени',
        symbol: '( bVII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b5 7 b3 ',
        name: 'мажорный кварт-секст-аккорд  b5-й ступени',
        symbol: '( VII 6/4 ) Ч4 + Б3 = Б6'
    },
    //минорные трезвучия
    {
        key: '1 b3 5 ',
        name: 'минорное трезвучие 1-ой ступени - тоническое',
        symbol: '( t 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b2 3 b6 ',
        name: 'минорное трезвучие b2-ой ступени',
        symbol: '( bii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '2 4 6 ',
        name: 'минорное трезвучие 2-ой ступени',
        symbol: '( ii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b3 b5 b7 ',
        name: 'минорное трезвучие b3-й ступени',
        symbol: '( biii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '3 5 7 ',
        name: 'минорное трезвучие 3-й ступени',
        symbol: '( iii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '4 b6 1 ',
        name: 'минорное трезвучие 4-ой ступени',
        symbol: '( s 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b5 6 b2 ',
        name: 'минорное трезвучие b5-ой ступени',
        symbol: '( bv 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '5 b7 2 ',
        name: 'минорное трезвучие 5-ой ступени',
        symbol: '( d 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b6 7 b3 ',
        name: 'минорное трезвучие b6-ой ступени',
        symbol: '( bvi 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '6 1 3 ',
        name: 'минорное трезвучие 6-ой ступени',
        symbol: '( vi 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b7 b2 4 ',
        name: 'минорное трезвучие b7-ой ступени',
        symbol: '( bvii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '7 2 b5 ',
        name: 'минорное трезвучие 7-ой ступени',
        symbol: '( vii 5/3 ) м3 + Б3 = Ч5'
    },
    //минорные секст-аккорды
    {
        key: 'b3 5 1 ',
        name: 'минорный секст-аккорд  b3-й ступени - тонический',
        symbol: '( t 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '3 b6 b2 ',
        name: 'минорный секст-аккорд  3-й ступени',
        symbol: '( bii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '4 6 2 ',
        name: 'минорный секст-аккорд  4-ой ступени',
        symbol: '( ii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b5 b7 b3 ',
        name: 'минорный секст-аккорд  b5-ой ступени',
        symbol: '( biii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '5 7 3 ',
        name: 'минорный секст-аккорд  5-ой ступени',
        symbol: '( iii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b6 1 4 ',
        name: 'минорный секст-аккорд  b6-ой ступени - субдоминантовый',
        symbol: '( s 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '6 b2 b5 ',
        name: 'минорный секст-аккорд  6-ой ступени',
        symbol: '( bv 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b7 2 5 ',
        name: 'минорный секст-аккорд  b7-ой ступени - доминантовый',
        symbol: '( d 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '7 b3 b6 ',
        name: 'минорный секст-аккорд  7-ой ступени',
        symbol: '( bvi 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '1 3 6 ',
        name: 'минорный секст-аккорд  1-ой ступени',
        symbol: '( vi 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b2 4 b7 ',
        name: 'минорный секст-аккорд  b2-ой ступени',
        symbol: '( bvii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '2 b5 7 ',
        name: 'минорный секст-аккорд  2-ой ступени',
        symbol: '( vii 6 ) Б3 + Ч4 = Б6'
    },
    //минорные кварт-секст-аккорды
    {
        key: '5 1 b3 ',
        name: 'минорный кварт-секст-аккорд  5-й ступени - тонический',
        symbol: '( T 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b6 b2 3 ',
        name: 'минорный кварт-секст-аккорд  b6-ой ступени',
        symbol: '( bii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '6 2 4 ',
        name: 'минорный кварт-секст-аккорд  6-ой ступени',
        symbol: '( ii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b7 b3 b5 ',
        name: 'минорный кварт-секст-аккорд  b7-ой ступени',
        symbol: '( biii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '7 3 5 ',
        name: 'минорный кварт-секст-аккорд  7-ой ступени',
        symbol: '( iii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '1 4 b6 ',
        name: 'минорный кварт-секст-аккорд  1-ой ступени - субдоминантовый',
        symbol: '( s 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b2 b5 6 ',
        name: 'минорный кварт-секст-аккорд  b2-ой ступени',
        symbol: '( bv 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '2 5 b7 ',
        name: 'минорный кварт-секст-аккорд  2-ой ступени - доминантовый',
        symbol: '( d 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b3 b6 7 ',
        name: 'минорный кварт-секст-аккорд  b3-й ступени',
        symbol: '( bvi 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '3 6 1 ',
        name: 'минорный кварт-секст-аккорд  3-й ступени',
        symbol: '( vi 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '4 b7 b2 ',
        name: 'минорный кварт-секст-аккорд  4-ой ступени',
        symbol: '( bvii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b5 7 2 ',
        name: 'минорный кварт-секст-аккорд  b5-й ступени',
        symbol: '( vii 6/4 ) Ч4 + м3 = м6'
    },
    //септ-аккорды диатонические
    {
        key: '1 3 5 7 ',
        name: 'Xmaj^ аккорд 1-ой ступени',
        symbol: 'Б3 + м3 + Б3 = Б7 (ч5/\ч5)'
    },
    {
        key: '2 4 6 1 ',
        name: 'Xm7 аккорд 2-ой ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '3 5 7 2 ',
        name: 'Xm7 аккорд 3-й ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '4 6 1 3 ',
        name: 'Xmaj^ аккорд 4-ой ступени',
        symbol: 'Б3 + м3 + Б3 = Б7 (ч5/\ч5)'
    },
    {
        key: '5 7 2 4 ',
        name: 'X7 аккорд 5-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '6 1 3 5 ',
        name: 'Xm7 аккорд 6-ой ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '7 2 4 6 ',
        name: 'Xm7b5 аккорд 7-ой ступени',
        symbol: 'м3 + м3 + Б3 = м7 (ТТТ/\ч5)'
    },
    //септ-аккорды доминантовые
    {
        key: '1 3 5 b7 ',
        name: 'X7 аккорд 1-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '2 b5 6 1 ',
        name: 'X7 аккорд 2-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '3 b6 7 2 ',
        name: 'X7 аккорд 3-й ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '4 6 1 b3 ',
        name: 'X7 аккорд 4-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '6 b2 3 5 ',
        name: 'X7 аккорд 6-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '7 b3 b5 6 ',
        name: 'X7 аккорд 7-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    //увеличенное трезвучие
    {
        key: '1 3 b6 ',
        name: 'увеличенное трезвучие 1-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b2 4 6 ',
        name: 'увеличенное трезвучие b2-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '2 b5 b7 ',
        name: 'увеличенное трезвучие 2-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b3 5 7 ',
        name: 'увеличенное трезвучие b3-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '3 b6 1 ',
        name: 'увеличенное трезвучие 3-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '4 6 b2 ',
        name: 'увеличенное трезвучие 4-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b5 b7 2 ',
        name: 'увеличенное трезвучие b5-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '5 7 b3 ',
        name: 'увеличенное трезвучие 5-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b6 1 3 ',
        name: 'увеличенное трезвучие b6-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '6 b2 4 ',
        name: 'увеличенное трезвучие 6-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b7 2 b5 ',
        name: 'увеличенное трезвучие b7-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '7 b3 5 ',
        name: 'увеличенное трезвучие 7-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    //септ-аккорды доминантовые
    {
        key: '1 2 3 4 5 6 7 ',
        name: 'ионийский',
        symbol: 'тетрахорды maj + maj'
    },
    {
        key: '1 2 3 4 5 6 7 1 ',
        name: 'ионийский',
        symbol: 'тетрахорды maj + maj'
    }
];

let five_Black = {
    'C': ['b2', 'b3', 'b5', 'b6', 'b7'],
    'Db': ['1', '2', '4', '5', '6', '8'],
    'D': ['7', 'b2', '3', 'b5', 'b6'],
    'Eb': ['b7', '1', 'b3', '4', '5', '8'],
    'E': ['6', '7', '2', '3', 'b5'],
    'F': ['b6', 'b7', 'b2', 'b3', '4'],
    'Gb': ['5', '6', '1', '2', '3', '8'],
    'G': ['b5', 'b6', '7', 'b2', 'b3'],
    'Ab': ['4', '5', 'b7', '1', '2', '8'],
    'A': ['3', 'b5', '6', '7', 'b2'],
    'Bb': ['b3', '4', 'b6', 'b7', '1', '8'],
    'B': ['2', '3', '5', '6', '7']
};

let noteName = [
    ['C', 'Db', 'D', 'Eb', 'E', 'F', 'TTT', 'G', 'Ab', 'A', 'Bb', 'B', 'C'],
    ['реb', 'миbb', 'миb', 'фаb', 'фа', 'сольb', 'TTT', 'ляb', 'сиbb', 'сиb', 'доb', 'до', 'реb'],
    ['ре', 'миb', 'ми', 'фа', 'фа#', 'соль', 'TTT', 'ля', 'сиb', 'си', 'до', 'до#', 'ре'],
    ['миb', 'фаb', 'фа', 'сольb', 'соль', 'ляb', 'TTT', 'сиb', 'доb', 'до', 'реb', 'ре', 'миb'],
    ['ми', 'фа', 'фа#', 'соль', 'соль#', 'ля', 'TTT', 'си', 'до', 'до#', 'ре', 'ре#', 'ми'],
    ['фа', 'сольb', 'соль', 'ляb', 'ля', 'сиb', 'TTT', 'до', 'реb', 'ре', 'миb', 'ми', 'фа'],
    ['сольb', 'ляbb', 'ляb', 'сиbb', 'сиb', 'доb', 'TTT', 'реb', 'миbb', 'миb', 'фаb', 'фа', 'сольb'],
    ['соль', 'ляb', 'ля', 'сиb', 'си', 'до', 'TTT', 'ре', 'миb', 'ми', 'фа', 'фа#', 'соль'],
    ['ляb', 'сиbb', 'сиb', 'доb', 'до', 'реb', 'TTT', 'миb', 'фаb', 'фа', 'сольb', 'соль', 'ляb'],
    ['ля', 'сиb', 'си', 'до', 'до#', 'ре', 'TTT', 'ми', 'фа', 'фа#', 'соль', 'соль#', 'ля'],
    ['сиb', 'доb', 'до', 'реb', 'ре', 'миb', 'TTT', 'фа', 'сольb', 'соль', 'ляb', 'ля', 'сиb'],
    ['си', 'до', 'до#', 'ре', 'ре#', 'ми', 'TTT', 'фа#', 'соль', 'соль#', 'ля', 'ля#', 'си']
];




oneDable.onclick = function () {
    keyboard_add3.classList.toggle('hideClass');
    // keyHide.classList.toggle('key_hide');
    // let newElement = keyboard_add.cloneNode(true);
    // console.log(newElement);
    // console.log(section);
    // section.append(newElement);
    // onload = workCode;
};

//функция подсветки голубым
for (let circle of key) {
    circle.onclick = function () {
        circle.classList.toggle('ledON');

        let finderLed = function (ledElement) {
            ledElement = document.querySelectorAll('.ledON');
            return ledElement;
        }
        monitor.textContent = '';
        monitor_2.textContent = '';
        for (let i = 0; i < finderLed().length; i++) {

            monitor.textContent += finderLed()[i].dataset.number + ' ';
        };
        // let perem = monitor.textContent;
        let poisk = ident.find(item => item.key == monitor.textContent);
        if (poisk) {
            monitor.textContent = poisk.name;
            monitor_2.textContent = poisk.symbol;
        };
    }
};

//функция очистки фортепианных клавиш
let clearKey = function () {
    for (let newList of key) {
        // newList.classList.remove('ledON');
        newList.classList.remove('x_item');
        newList.classList.remove('circle');

        //   newList.classList.remove('tonika');
        monitor.textContent = '';
        monitor_2.textContent = '';
    }
}

//кнопка сброс
clear.onclick = function () {
    for (let newList of key) {
        newList.classList.remove('ledON');
        newList.classList.remove('x_item');
        newList.classList.remove('circle');
        newList.classList.remove('triangle');
        newList.classList.remove('symmetric_left');
        newList.classList.remove('symmetric_right');
        monitor.textContent = '';
        monitor_2.textContent = '';
    }
};



// функция сортировки и присваивания класса black_key
var calculateMassive = function (massive) {
    console.log(massive);
    for (let item of elements) {
        if (massive.includes(item.dataset.number)) {
            item.classList.add('black_key');
        }
    }
};
console.log(five_Black['C']);
calculateMassive(five_Black['C']);

//нумерация клавиш цифрами
let noteLabel = function (input, output) {
    for (var i = 0; i < paragrNumb.length; i++) {
        if (input.checked == true) {
            paragrNumb[i].textContent = output[i];
            if (output[i] == "+" || output[i] == 'Б2' || output[i] == 'Б3' || output[i] == 'Б6' || output[i] == 'Б7' || output[i] == 'ч1' || output[i] == 'ч4' || output[i] == 'ч5') {
                paragrNumb[i].style.fontSize = '40px';
                paragrNumb[i].style.color = 'orange';
            } else if (output[i] == "-" || output[i] == "+/-") {
                paragrNumb[i].style.fontSize = '50px';
            } else {
                paragrNumb[i].style.fontSize = '24px';
                paragrNumb[i].style.color = 'rgb(4, 0, 255)';
            }
        } else {
            paragrNumb[i].textContent = '';
        }
    }
};

let noteLabelCenter = function (input, output) {
    for (var i = 7; i < paragrNumb.length; i++) {
        if (input.checked == true) {
            paragrNumb[i].textContent = output[i];
        } else {
            paragrNumb[i].textContent = '';
        }
    }
};
notes_Number.addEventListener('click', function () {
    // console.log('check');
    noteLabel(notes_Number, notes_Number_mas);
});

halftones.addEventListener('click', function () {
    // console.log('check');
    noteLabel(halftones, halftones_mas);
});

wholetones.addEventListener('click', function () {
    // console.log('check');
    noteLabel(wholetones, wholetones_mas);
});


notes_Intervals.addEventListener('click', function () {
    // console.log('check');
    noteLabel(notes_Intervals, notes_Intervals_mas);
});

notes_rim.addEventListener('click', function () {
    // console.log('check');
    noteLabel(notes_rim, notes_rim_mas);
});

notes_123.addEventListener('click', function () {
    // console.log('check');
    noteLabel(notes_123, notes_123_mas);
});

maj_min.addEventListener('click', function () {
    // console.log('check');
    noteLabel(maj_min, maj_min_mas);
});

extensions.addEventListener('click', function () {
    // console.log('check');
    noteLabel(extensions, extensions_mas);
});

chords.addEventListener('click', function () {
    // console.log('check');
    noteLabel(chords, chords_mas);
});

relative.addEventListener('click', function () {
    // console.log('check');
    noteLabel(relative, relative_mas);
    noteColor();
    console.log("YES");
});

relative_center.addEventListener('click', function () {
    // console.log('check');
    noteLabelCenter(relative_center, relative_center_mas);
    noteColorCenter();
    console.log("YES");
});

//расскрашивание клавиш
let noteColor = function () {
    for (var i = 0; i < key.length; i++) {
        key[i].style.backgroundColor = color[i];

    }
};

//расскрашивание клавиш
let noteColorCenter = function () {
    for (var i = 7; i < key.length; i++) {
        key[i].style.backgroundColor = color_center[i];

    }
};

//функция прорисовки ноликов и крестиков
let x_circle_function = function (x_item, circle, xxx, yyy) {
    // console.log(invert);
    if (wholeToneBoolean == true) {
        start_x = 0;
        start_circle = 1;
    } else if (wholeToneBoolean == false) {
        start_x = 1;
        start_circle = 0;
    }
    if (x_item) {
        for (let i = start_x; i <= key.length - 1; i += xxx) {
            key[i].classList.toggle('x_item');
        }
    }
    if (circle) {
        for (let i = start_circle; i <= key.length - 1; i += yyy) {
            key[i].classList.toggle('circle');
        };
    };
};

//Запуск целотоновой гаммы 1
wholetoneButtonX.onclick = function () {
    clearKey();
    x_circle_function('x_item', "", 2, 2);
    monitor.textContent = this.dataset.symbol;
    x_item_led_boolean ^= true;

    // conflict();
};
//Запуск целотоновой гаммы 2
wholetoneButtonY.onclick = function () {
    clearKey();
    x_circle_function("", 'circle', 2, 2);
    monitor.textContent = this.dataset.symbol;
    circle_led_boolean ^= true;

    // conflict();
}

//Запуск целотоновых гамм 1 и 2
wholetoneButtonXY.onclick = function () {
    clearKey();
    x_circle_function('x_item', 'circle', 2, 2);
    monitor.textContent = this.dataset.symbol;
    x_item_led_boolean ^= true;
    circle_led_boolean ^= true;
    // conflict();
};

// создаем функцию слушания клика
let keyboard_vision_tonality_count = 12;

function tonality_sound() {
    for (let i = 0; i < all_key_for_sound.length; i++) {
        all_key_for_sound[i].dataset.src = array_of_nodelist[i + 12].src;
    }
}
tonality_sound();
let button_vision_section = document.querySelector('.button_vision_section');

button_vision_section.addEventListener('click', function (event) {

    let el = event.target;
    // keyboard_vision_tonality_count = Number(el.dataset.count) + 12;
    console.log(keyboard_vision_tonality_count);
    if (["C", "D", "E", "Gb", "Ab", "Bb"].includes(el.dataset.mas)) {
        wholeToneBoolean = true;
    } else {
        wholeToneBoolean = false;
    }
    for (var i = 0; i < elements.length; i++) {
        elements[i].classList.remove("black_key"); //сброс со всех клавиш класса black
    }

    tonality_sound();

    calculateMassive(five_Black[event.target.dataset.mas]);
    if (x_item_led_boolean == 1 & circle_led_boolean != 1) {
        clearKey();
        x_circle_function('x_item', null, 2, 2);
    } else if (x_item_led_boolean != 1 & circle_led_boolean == 1) {
        clearKey();
        x_circle_function(null, 'circle', 2, 2);

    } else if (x_item_led_boolean == 1 & circle_led_boolean == 1) {
        clearKey();
        x_circle_function('x_item', 'circle', 2, 2);
    }
})



let set_34 = true;

var addClickEvent_34 = function (button, numb) {

    button.addEventListener('click', function () {
        if (button.textContent == "C" || button.textContent == "D" || button.textContent == "E" || button.textContent == "Gb" || button.textContent == "Ab" || button.textContent == "Bb") {
            clearKey();
            console.log(numb);
            for (let i = numb - 1; i <= numb; i += 2) {
                key[i].classList.toggle('x_item')
                key[i + 2].classList.toggle('x_item')
                key[i + 4].classList.toggle('x_item')
                key[i + 5].classList.toggle('circle')
                key[i + 7].classList.toggle('circle')
                key[i + 9].classList.toggle('circle')
                key[i + 11].classList.toggle('circle');
            }

        } else {
            clearKey();
            for (let i = numb - 1; i <= numb; i += 12) {
                key[i].classList.toggle('circle')
                key[i + 2].classList.toggle('circle')
                key[i + 4].classList.toggle('circle')
                key[i + 5].classList.toggle('x_item')
                key[i + 7].classList.toggle('x_item')
                key[i + 9].classList.toggle('x_item')
                key[i + 11].classList.toggle('x_item');
            }
        }
    })
};

// циклом запускаем функцию на все кнопки
// for (var i = 0; i < buttons.length; i++) {
//     addClickEvent(buttons[i], five_Black[i], set_34);
// };




// циклом запускаем функцию на все кнопки мажоры 34
for (var i = 0; i < buttons_34.length; i++) {
    addClickEvent_34(buttons_34[i], buttons_34[i].dataset.numb);
};

// активация гаммы тон полутон - 1
whole_and_half_step_1.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i].classList.toggle('x_item');
        key[i + 2].classList.toggle('x_item');
        key[i + 3].classList.toggle('circle');
        key[i + 5].classList.toggle('circle');
    }
}

// активация гаммы тон полутон - 2
whole_and_half_step_2.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i + 1].classList.toggle('circle');
        key[i + 3].classList.toggle('circle');
        key[i + 4].classList.toggle('x_item');
        key[i + 6].classList.toggle('x_item');
    }
}

// активация гаммы тон полутон - 3
whole_and_half_step_3.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i + 1].classList.toggle('circle');
        key[i + 2].classList.toggle('x_item');
        key[i + 4].classList.toggle('x_item');
        key[i + 5].classList.toggle('circle');
    }
}

// активация симметрии - 1
symmetric_1.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i + 2].classList.toggle('triangle');
        key[i + 5].classList.toggle('triangle');
    }
}

// активация симметрии - 2
symmetric_2.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i].classList.toggle('symmetric_left');
        key[i + 3].classList.toggle('symmetric_left');
    }
}

// активация симметрии - 3
symmetric_3.onclick = function () {
    clearKey();
    monitor.textContent = this.dataset.symbol;
    for (let i = 0; i <= 30; i += 6) {

        key[i + 1].classList.toggle('symmetric_right');
        key[i + 4].classList.toggle('symmetric_right');
    }
}


// =================================== ВОСПРОИЗВЕДЕНИЕ ЗВУКА =================================
function playArray(newArray) {
    let list = Array.from(newArray);
    let audioElements = [];
    let int = 1;
    for (let i = 0; i < list.length; i++) {
        let audio = new Audio(list[i].dataset.src);
        audioElements.push(audio);
        setTimeout(function () {
            audioElements[i].play()
        }, int * 300);
        int += 1;
    }
}







let section_for_contextmenu = document.querySelector('.section');
section_for_contextmenu.addEventListener('contextmenu', function (event) {
    event.target.classList.add('play_led')
    let audio = new Audio(event.target.dataset.src);
    audio.play();
    event.preventDefault(false);
    setTimeout(function () {
        event.target.classList.remove('play_led')
    }, 200)
})

let clear_2 = document.querySelector('.clear_2');
clear_2.addEventListener('click', function () {
    for (let item of all_key_for_sound) {
        item.classList.remove('ledON')
    }
});