let ident = [
    //малые секунды
    {
        key: '1 b2 ',
        name: 'малая секунда от 1-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b2 2 ',
        name: 'малая секунда от b2-ой ступени',
        symbol: 'м2'
    },
    {
        key: '2 b3 ',
        name: 'малая секунда от 2-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b3 3 ',
        name: 'малая секунда от b3-ой ступени',
        symbol: 'м2'
    },
    {
        key: '3 4 ',
        name: 'малая секунда от 3-ой ступени',
        symbol: 'м2'
    },
    {
        key: '4 b5 ',
        name: 'малая секунда от 4-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b5 5 ',
        name: 'малая секунда от b5-ой ступени',
        symbol: 'м2'
    },
    {
        key: '5 b6 ',
        name: 'малая секунда от 5-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b6 6 ',
        name: 'малая секунда от b6-ой ступени',
        symbol: 'м2'
    },
    {
        key: '6 b7 ',
        name: 'малая секунда от 6-ой ступени',
        symbol: 'м2'
    },
    {
        key: 'b7 7 ',
        name: 'малая секунда от b7-ой ступени',
        symbol: 'м2'
    },
    {
        key: '7 1 ',
        name: 'малая секунда от 7-ой ступени',
        symbol: 'м2'
    },
    //большие секунды
    {
        key: '1 2 ',
        name: 'большая секунда от 1-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b2 b3 ',
        name: 'большая секунда от b2-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '2 3 ',
        name: 'большая секунда от 2-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b3 4 ',
        name: 'большая секунда от b3-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '3 b5 ',
        name: 'большая секунда от 3-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '4 5 ',
        name: 'большая секунда от 4-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b5 b6 ',
        name: 'большая секунда от b5-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '5 6 ',
        name: 'большая секунда от 5-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b6 b7 ',
        name: 'большая секунда от b6-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '6 7 ',
        name: 'большая секунда от 6-ой ступени',
        symbol: 'Б2'
    },
    {
        key: 'b7 1 ',
        name: 'большая секунда от b7-ой ступени',
        symbol: 'Б2'
    },
    {
        key: '7 b2 ',
        name: 'большая секунда от 7-ой ступени',
        symbol: 'Б2'
    },
    //малые терции
    {
        key: '1 b3 ',
        name: 'малая терция от 1-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b2 3 ',
        name: 'малая терция от b2-ой ступени',
        symbol: 'м3'
    },
    {
        key: '2 4 ',
        name: 'малая терция от 2-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b3 b5 ',
        name: 'малая терция от b3-ой ступени',
        symbol: 'м3'
    },
    {
        key: '3 5 ',
        name: 'малая терция от 3-ой ступени',
        symbol: 'м3'
    },
    {
        key: '4 b6 ',
        name: 'малая терция от 4-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b5 6 ',
        name: 'малая терция от b5-ой ступени',
        symbol: 'м3'
    },
    {
        key: '5 b7 ',
        name: 'малая терция от 5-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b6 7 ',
        name: 'малая терция от b6-ой ступени',
        symbol: 'м3'
    },
    {
        key: '6 1 ',
        name: 'малая терция от 6-ой ступени',
        symbol: 'м3'
    },
    {
        key: 'b7 b2 ',
        name: 'малая терция от b7-ой ступени',
        symbol: 'м3'
    },
    {
        key: '7 2 ',
        name: 'малая терция от 7-ой ступени',
        symbol: 'м3'
    },
    //большие терции
    {
        key: '1 3 ',
        name: 'большая терция от 1-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b2 4 ',
        name: 'большая терция от b2-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '2 b5 ',
        name: 'большая терция от 2-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b3 5 ',
        name: 'большая терция от b3-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '3 b6 ',
        name: 'большая терция от 3-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '4 6 ',
        name: 'большая терция от 4-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b5 b7 ',
        name: 'большая терция от b5-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '5 7 ',
        name: 'большая терция от 5-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b6 1 ',
        name: 'большая терция от b6-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '6 b2 ',
        name: 'большая терция от 6-ой ступени',
        symbol: 'Б3'
    },
    {
        key: 'b7 2 ',
        name: 'большая терция от b7-ой ступени',
        symbol: 'Б3'
    },
    {
        key: '7 b3 ',
        name: 'большая терция от 7-ой ступени',
        symbol: 'Б3'
    },
    //чистые кварты
    {
        key: '1 4 ',
        name: 'чистая кварта от 1-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b2 b5 ',
        name: 'чистая кварта от b2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '2 5 ',
        name: 'чистая кварта от 2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b3 b6 ',
        name: 'чистая кварта от b3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '3 6 ',
        name: 'чистая кварта от 3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '4 b7 ',
        name: 'чистая кварта от 4-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b5 7 ',
        name: 'чистая кварта от b5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '5 1 ',
        name: 'чистая кварта от 5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b6 b2 ',
        name: 'чистая кварта от b6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '6 2 ',
        name: 'чистая кварта от 6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b7 b3 ',
        name: 'чистая кварта от b7-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '7 3 ',
        name: 'чистая кварта от 7-ой ступени',
        symbol: 'Ч5'
    },
    //тритоны
    {
        key: '1 b5 ',
        name: 'тритон от 1-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b2 5 ',
        name: 'тритон от b2-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '2 b6 ',
        name: 'тритон от 2-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b3 6 ',
        name: 'тритон от b3-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '3 b7 ',
        name: 'тритон от 3-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '4 7 ',
        name: 'тритон от 4-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b5 1 ',
        name: 'тритон от b5-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '5 b2 ',
        name: 'тритон от 5-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b6 2 ',
        name: 'тритон от b6-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '6 b3 ',
        name: 'тритон от 6-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: 'b7 3 ',
        name: 'тритон от b7-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    {
        key: '7 4 ',
        name: 'тритон от 7-ой ступени',
        symbol: 'TTT (ув4/ум5)'
    },
    //чистые квинты
    {
        key: '1 5 ',
        name: 'чистая квинта от 1-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b2 b6 ',
        name: 'чистая квинта от b2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '2 6 ',
        name: 'чистая квинта от 2-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b3 b7 ',
        name: 'чистая квинта от b3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '3 7 ',
        name: 'чистая квинта от 3-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '4 1 ',
        name: 'чистая квинта от 4-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b5 b2 ',
        name: 'чистая квинта от b5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '5 2 ',
        name: 'чистая квинта от 5-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b6 b3 ',
        name: 'чистая квинта от b6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '6 3 ',
        name: 'чистая квинта от 6-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: 'b7 4 ',
        name: 'чистая квинта от b7-ой ступени',
        symbol: 'Ч5'
    },
    {
        key: '7 b5 ',
        name: 'чистая квинта от 7-ой ступени',
        symbol: 'Ч5'
    },
    //малые сексты
    {
        key: '1 b6 ',
        name: 'малая секста от 1-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b2 6 ',
        name: 'малая секста от b2-ой ступени',
        symbol: 'м6'
    },
    {
        key: '2 b7 ',
        name: 'малая секста от 2-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b3 7 ',
        name: 'малая секста от b3-ой ступени',
        symbol: 'м6'
    },
    {
        key: '3 1 ',
        name: 'малая секста от 3-ой ступени',
        symbol: 'м6'
    },
    {
        key: '4 b2 ',
        name: 'малая секста от 4-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b5 2 ',
        name: 'малая секста от b5-ой ступени',
        symbol: 'м6'
    },
    {
        key: '5 b3 ',
        name: 'малая секста от 5-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b6 3 ',
        name: 'малая секста от b6-ой ступени',
        symbol: 'м6'
    },
    {
        key: '6 4 ',
        name: 'малая секста от 6-ой ступени',
        symbol: 'м6'
    },
    {
        key: 'b7 b5 ',
        name: 'малая секста от b7-ой ступени',
        symbol: 'м6'
    },
    {
        key: '7 5 ',
        name: 'малая секста от 7-ой ступени',
        symbol: 'м6'
    },
    //большие сексты
    {
        key: '1 6 ',
        name: 'большая секста от 1-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b2 b7 ',
        name: 'большая секста от b2-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '2 7 ',
        name: 'большая секста от 2-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b3 1 ',
        name: 'большая секста от b3-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '3 b2 ',
        name: 'большая секста от 3-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '4 2 ',
        name: 'большая секста от 4-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b5 b3 ',
        name: 'большая секста от b5-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '5 3 ',
        name: 'большая секста от 5-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b6 4 ',
        name: 'большая секста от b6-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '6 b5 ',
        name: 'большая секста от 6-ой ступени',
        symbol: 'Б6'
    },
    {
        key: 'b7 5 ',
        name: 'большая секста от b7-ой ступени',
        symbol: 'Б6'
    },
    {
        key: '7 b6 ',
        name: 'большая секста от 7-ой ступени',
        symbol: 'Б6'
    },
    //мылые септимы
    {
        key: '1 b7 ',
        name: 'малая септима от 1-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b2 7 ',
        name: 'малая септима от b2-ой ступени',
        symbol: 'м7'
    },
    {
        key: '2 1 ',
        name: 'малая септима от 2-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b3 b2 ',
        name: 'малая септима от b3-ой ступени',
        symbol: 'м7'
    },
    {
        key: '3 2 ',
        name: 'малая септима от 3-ой ступени',
        symbol: 'м7'
    },
    {
        key: '4 b3 ',
        name: 'малая септима от 4-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b5 3 ',
        name: 'малая септима от b5-ой ступени',
        symbol: 'м7'
    },
    {
        key: '5 4 ',
        name: 'малая септима от 5-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b6 b5 ',
        name: 'малая септима от b6-ой ступени',
        symbol: 'м7'
    },
    {
        key: '6 5 ',
        name: 'малая септима от 6-ой ступени',
        symbol: 'м7'
    },
    {
        key: 'b7 b6 ',
        name: 'малая септима от b7-ой ступени',
        symbol: 'м7'
    },
    {
        key: '7 6 ',
        name: 'малая септима от 7-ой ступени',
        symbol: 'м7'
    },
    //большие септимы
    {
        key: '1 7 ',
        name: 'большая септима от 1-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b2 1 ',
        name: 'большая септима от b2-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '2 b2 ',
        name: 'большая септима от 2-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b3 2 ',
        name: 'большая септима от b3-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '3 b3 ',
        name: 'большая септима от 3-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '4 3 ',
        name: 'большая септима от 4-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b5 4 ',
        name: 'большая септима от b5-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '5 b5 ',
        name: 'большая септима от 5-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b6 5 ',
        name: 'большая септима от b6-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '6 b6 ',
        name: 'большая септима от 6-ой ступени',
        symbol: 'Б7'
    },
    {
        key: 'b7 6 ',
        name: 'большая септима от b7-ой ступени',
        symbol: 'Б7'
    },
    {
        key: '7 b7 ',
        name: 'большая септима от 7-ой ступени',
        symbol: 'Б7'
    },
    //тетрахорды тональные
    {
        key: '1 2 3 4 ',
        name: 'мажорный тетрахорд от 1-ой ступени',
        symbol: '4-maj'
    },
    {
        key: '2 3 4 5 ',
        name: 'минорный тетрахорд от 2-ой ступени',
        symbol: '4-min'
    },
    {
        key: '3 4 5 6 ',
        name: 'фригийский тетрахорд от 3-й ступени',
        symbol: '4-frig'
    },
    {
        key: '4 5 6 7 ',
        name: 'целотоновый тетрахорд от 4-ой ступени',
        symbol: '4-TTT'
    },
    {
        key: '5 6 7 1 ',
        name: 'мажорный тетрахорд от 5-ой ступени',
        symbol: '4-maj'
    },
    {
        key: '6 7 1 2 ',
        name: 'минорный тетрахорд от 6-ой ступени',
        symbol: '4-min'
    },
    {
        key: '7 1 2 3 ',
        name: 'фригийский тетрахорд от 7-ой ступени',
        symbol: '4-frig'
    },
    //уменьшенные трезвучия
    {
        key: '1 b3 b5 ',
        name: 'уменьшенное трезвучие 1-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b2 3 5 ',
        name: 'уменьшенное трезвучие b2-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '2 4 b6 ',
        name: 'уменьшенное трезвучие 2-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b3 b5 6 ',
        name: 'уменьшенное трезвучие b3-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '3 5 b7 ',
        name: 'уменьшенное трезвучие 3-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '4 b6 7 ',
        name: 'уменьшенное трезвучие 4-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b5 6 1 ',
        name: 'уменьшенное трезвучие b5-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '5 b7 b2 ',
        name: 'уменьшенное трезвучие 5-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b6 7 2 ',
        name: 'уменьшенное трезвучие b6-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '6 1 b3 ',
        name: 'уменьшенное трезвучие 6-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: 'b7 b2 3 ',
        name: 'уменьшенное трезвучие b7-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    {
        key: '7 2 4 ',
        name: 'уменьшенное трезвучие 7-ой ступени',
        symbol: '(ум 5/3) м3 + м3 = ТТТ'
    },
    //мажорные трезвучия
    {
        key: '1 3 5 ',
        name: 'мажорное трезвучие 1-ой ступени - тоническое',
        symbol: '( T 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b2 4 b6 ',
        name: 'мажорное трезвучие b2-ой ступени',
        symbol: '( bII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '2 b5 6 ',
        name: 'мажорное трезвучие 2-ой ступени',
        symbol: '( II 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b3 5 b7 ',
        name: 'мажорное трезвучие b3-й ступени',
        symbol: '( bIII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '3 b6 7 ',
        name: 'мажорное трезвучие 3-й ступени',
        symbol: '( III 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '4 6 1 ',
        name: 'мажорное трезвучие 4-ой ступени - субдоминантовое',
        symbol: '( S 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b5 b7 b2 ',
        name: 'мажорное трезвучие b5-ой ступени',
        symbol: '( bV 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '5 7 2 ',
        name: 'мажорное трезвучие 5-ой ступени - доминантовое',
        symbol: '( D 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b6 1 b3 ',
        name: 'мажорное трезвучие b6-ой ступени',
        symbol: '( bVI 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '6 b2 3 ',
        name: 'мажорное трезвучие 6-ой ступени',
        symbol: '( VI 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: 'b7 2 4 ',
        name: 'мажорное трезвучие b7-ой ступени',
        symbol: '( bVII 5/3 ) Б3 + м3 = Ч5'
    },
    {
        key: '7 b3 b5 ',
        name: 'мажорное трезвучие 7-ой ступени',
        symbol: '( VII 5/3 ) Б3 + м3 = Ч5'
    },
    //мажорные секст-аккорды
    {
        key: '3 5 1 ',
        name: 'мажорный секст-аккорд  3-й ступени - тонический',
        symbol: '( T 6 ) м3 + Ч4 = м6'
    },
    {
        key: '4 b6 b2 ',
        name: 'мажорный секст-аккорд  4-ой ступени',
        symbol: '( bII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b5 6 2 ',
        name: 'мажорный секст-аккорд  b5-ой ступени',
        symbol: '( II 6 ) м3 + Ч4 = м6'
    },
    {
        key: '5 b7 b3 ',
        name: 'мажорный секст-аккорд  5-ой ступени',
        symbol: '( bIII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b6 7 3 ',
        name: 'мажорный секст-аккорд  b6-ой ступени',
        symbol: '( III 6 ) м3 + Ч4 = м6'
    },
    {
        key: '6 1 4 ',
        name: 'мажорный секст-аккорд  6-ой ступени - субдоминантовый',
        symbol: '( S 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b7 b2 b5 ',
        name: 'мажорный секст-аккорд  b7-ой ступени',
        symbol: '( bV 6 ) м3 + Ч4 = м6'
    },
    {
        key: '7 2 5 ',
        name: 'мажорный секст-аккорд  7-ой ступени - доминантовый',
        symbol: '( D 6 ) м3 + Ч4 = м6'
    },
    {
        key: '1 b3 b6 ',
        name: 'мажорный секст-аккорд  1-ой ступени',
        symbol: '( bVI 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b2 3 6 ',
        name: 'мажорный секст-аккорд  b2-ой ступени',
        symbol: '( VI 6 ) м3 + Ч4 = м6'
    },
    {
        key: '2 4 b7 ',
        name: 'мажорный секст-аккорд  2-ой ступени',
        symbol: '( bVII 6 ) м3 + Ч4 = м6'
    },
    {
        key: 'b3 b5 7 ',
        name: 'мажорный секст-аккорд  b3-й ступени',
        symbol: '( VII 6 ) м3 + Ч4 = м6'
    },
    //мажорные кварт-секст-аккорды
    {
        key: '5 1 3 ',
        name: 'мажорный кварт-секст-аккорд  5-й ступени - тонический',
        symbol: '( T 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b6 b2 4 ',
        name: 'мажорный кварт-секст-аккорд  b6-ой ступени',
        symbol: '( bII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '6 2 b5 ',
        name: 'мажорный кварт-секст-аккорд  6-ой ступени',
        symbol: '( II 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b7 b3 5 ',
        name: 'мажорный кварт-секст-аккорд  b7-ой ступени',
        symbol: '( bIII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '7 3 b6 ',
        name: 'мажорный кварт-секст-аккорд  7-ой ступени',
        symbol: '( III 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '1 4 6 ',
        name: 'мажорный кварт-секст-аккорд  1-ой ступени - субдоминантовый',
        symbol: '( S 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b2 b5 b7 ',
        name: 'мажорный кварт-секст-аккорд  b2-ой ступени',
        symbol: '( bV 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '2 5 7 ',
        name: 'мажорный кварт-секст-аккорд  2-ой ступени - доминантовый',
        symbol: '( D 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b3 b6 1 ',
        name: 'мажорный кварт-секст-аккорд  b3-й ступени',
        symbol: '( bVI 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '3 6 b2 ',
        name: 'мажорный кварт-секст-аккорд  3-й ступени',
        symbol: '( VI 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: '4 b7 2 ',
        name: 'мажорный кварт-секст-аккорд  4-ой ступени',
        symbol: '( bVII 6/4 ) Ч4 + Б3 = Б6'
    },
    {
        key: 'b5 7 b3 ',
        name: 'мажорный кварт-секст-аккорд  b5-й ступени',
        symbol: '( VII 6/4 ) Ч4 + Б3 = Б6'
    },
    //минорные трезвучия
    {
        key: '1 b3 5 ',
        name: 'минорное трезвучие 1-ой ступени - тоническое',
        symbol: '( t 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b2 3 b6 ',
        name: 'минорное трезвучие b2-ой ступени',
        symbol: '( bii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '2 4 6 ',
        name: 'минорное трезвучие 2-ой ступени',
        symbol: '( ii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b3 b5 b7 ',
        name: 'минорное трезвучие b3-й ступени',
        symbol: '( biii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '3 5 7 ',
        name: 'минорное трезвучие 3-й ступени',
        symbol: '( iii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '4 b6 1 ',
        name: 'минорное трезвучие 4-ой ступени',
        symbol: '( s 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b5 6 b2 ',
        name: 'минорное трезвучие b5-ой ступени',
        symbol: '( bv 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '5 b7 2 ',
        name: 'минорное трезвучие 5-ой ступени',
        symbol: '( d 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b6 7 b3 ',
        name: 'минорное трезвучие b6-ой ступени',
        symbol: '( bvi 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '6 1 3 ',
        name: 'минорное трезвучие 6-ой ступени',
        symbol: '( vi 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: 'b7 b2 4 ',
        name: 'минорное трезвучие b7-ой ступени',
        symbol: '( bvii 5/3 ) м3 + Б3 = Ч5'
    },
    {
        key: '7 2 b5 ',
        name: 'минорное трезвучие 7-ой ступени',
        symbol: '( vii 5/3 ) м3 + Б3 = Ч5'
    },
    //минорные секст-аккорды
    {
        key: 'b3 5 1 ',
        name: 'минорный секст-аккорд  b3-й ступени - тонический',
        symbol: '( t 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '3 b6 b2 ',
        name: 'минорный секст-аккорд  3-й ступени',
        symbol: '( bii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '4 6 2 ',
        name: 'минорный секст-аккорд  4-ой ступени',
        symbol: '( ii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b5 b7 b3 ',
        name: 'минорный секст-аккорд  b5-ой ступени',
        symbol: '( biii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '5 7 3 ',
        name: 'минорный секст-аккорд  5-ой ступени',
        symbol: '( iii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b6 1 4 ',
        name: 'минорный секст-аккорд  b6-ой ступени - субдоминантовый',
        symbol: '( s 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '6 b2 b5 ',
        name: 'минорный секст-аккорд  6-ой ступени',
        symbol: '( bv 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b7 2 5 ',
        name: 'минорный секст-аккорд  b7-ой ступени - доминантовый',
        symbol: '( d 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '7 b3 b6 ',
        name: 'минорный секст-аккорд  7-ой ступени',
        symbol: '( bvi 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '1 3 6 ',
        name: 'минорный секст-аккорд  1-ой ступени',
        symbol: '( vi 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: 'b2 4 b7 ',
        name: 'минорный секст-аккорд  b2-ой ступени',
        symbol: '( bvii 6 ) Б3 + Ч4 = Б6'
    },
    {
        key: '2 b5 7 ',
        name: 'минорный секст-аккорд  2-ой ступени',
        symbol: '( vii 6 ) Б3 + Ч4 = Б6'
    },
    //минорные кварт-секст-аккорды
    {
        key: '5 1 b3 ',
        name: 'минорный кварт-секст-аккорд  5-й ступени - тонический',
        symbol: '( T 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b6 b2 3 ',
        name: 'минорный кварт-секст-аккорд  b6-ой ступени',
        symbol: '( bii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '6 2 4 ',
        name: 'минорный кварт-секст-аккорд  6-ой ступени',
        symbol: '( ii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b7 b3 b5 ',
        name: 'минорный кварт-секст-аккорд  b7-ой ступени',
        symbol: '( biii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '7 3 5 ',
        name: 'минорный кварт-секст-аккорд  7-ой ступени',
        symbol: '( iii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '1 4 b6 ',
        name: 'минорный кварт-секст-аккорд  1-ой ступени - субдоминантовый',
        symbol: '( s 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b2 b5 6 ',
        name: 'минорный кварт-секст-аккорд  b2-ой ступени',
        symbol: '( bv 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '2 5 b7 ',
        name: 'минорный кварт-секст-аккорд  2-ой ступени - доминантовый',
        symbol: '( d 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b3 b6 7 ',
        name: 'минорный кварт-секст-аккорд  b3-й ступени',
        symbol: '( bvi 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '3 6 1 ',
        name: 'минорный кварт-секст-аккорд  3-й ступени',
        symbol: '( vi 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: '4 b7 b2 ',
        name: 'минорный кварт-секст-аккорд  4-ой ступени',
        symbol: '( bvii 6/4 ) Ч4 + м3 = м6'
    },
    {
        key: 'b5 7 2 ',
        name: 'минорный кварт-секст-аккорд  b5-й ступени',
        symbol: '( vii 6/4 ) Ч4 + м3 = м6'
    },
    //септ-аккорды диатонические
    {
        key: '1 3 5 7 ',
        name: 'Xmaj^ аккорд 1-ой ступени',
        symbol: 'Б3 + м3 + Б3 = Б7 (ч5/\ч5)'
    },
    {
        key: '2 4 6 1 ',
        name: 'Xm7 аккорд 2-ой ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '3 5 7 2 ',
        name: 'Xm7 аккорд 3-й ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '4 6 1 3 ',
        name: 'Xmaj^ аккорд 4-ой ступени',
        symbol: 'Б3 + м3 + Б3 = Б7 (ч5/\ч5)'
    },
    {
        key: '5 7 2 4 ',
        name: 'X7 аккорд 5-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '6 1 3 5 ',
        name: 'Xm7 аккорд 6-ой ступени',
        symbol: 'м3 + Б3 + м3 = м7 (ч5/\ч5)'
    },
    {
        key: '7 2 4 6 ',
        name: 'Xm7b5 аккорд 7-ой ступени',
        symbol: 'м3 + м3 + Б3 = м7 (ТТТ/\ч5)'
    },
    //септ-аккорды доминантовые
    {
        key: '1 3 5 b7 ',
        name: 'X7 аккорд 1-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '2 b5 6 1 ',
        name: 'X7 аккорд 2-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '3 b6 7 2 ',
        name: 'X7 аккорд 3-й ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '4 6 1 b3 ',
        name: 'X7 аккорд 4-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '6 b2 3 5 ',
        name: 'X7 аккорд 6-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    {
        key: '7 b3 b5 6 ',
        name: 'X7 аккорд 7-ой ступени',
        symbol: 'Б3 + м3 + м3 = м7 (ч5/\ТТТ)'
    },
    //увеличенное трезвучие
    {
        key: '1 3 b6 ',
        name: 'увеличенное трезвучие 1-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b2 4 6 ',
        name: 'увеличенное трезвучие b2-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '2 b5 b7 ',
        name: 'увеличенное трезвучие 2-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b3 5 7 ',
        name: 'увеличенное трезвучие b3-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '3 b6 1 ',
        name: 'увеличенное трезвучие 3-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '4 6 b2 ',
        name: 'увеличенное трезвучие 4-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b5 b7 2 ',
        name: 'увеличенное трезвучие b5-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '5 7 b3 ',
        name: 'увеличенное трезвучие 5-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b6 1 3 ',
        name: 'увеличенное трезвучие b6-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '6 b2 4 ',
        name: 'увеличенное трезвучие 6-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: 'b7 2 b5 ',
        name: 'увеличенное трезвучие b7-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    {
        key: '7 b3 5 ',
        name: 'увеличенное трезвучие 7-ой ступени',
        symbol: '(ув 5/3) Б3 + Б3 = м6'
    },
    //септ-аккорды доминантовые
    {
        key: '1 2 3 4 5 6 7 ',
        name: 'ионийский',
        symbol: 'тетрахорды maj + maj'
    },
    {
        key: '1 2 3 4 5 6 7 1 ',
        name: 'ионийский',
        symbol: 'тетрахорды maj + maj'
    }
];